Revit 2021.1 API
ImageType Properties
The ImageType type exposes the following members.
Properties
Name | Description
AssemblyInstanceId
 The id of the assembly instance to which the element belongs.
 (Inherited from Element.)
BoundingBox
Retrieves a box that circumscribes all geometry of the element.
 (Inherited from Element.)
CanBeCopied
 Determine if this ElementType can create a copy
 (Inherited from ElementType.)
CanBeDeleted
 Determine if this ElementType can be deleted
 (Inherited from ElementType.)
CanBeRenamed
 Determine if this ElementType can be renamed
 (Inherited from ElementType.)
Category
Retrieves a Category object that represents the category or sub category in which the element resides.
 (Inherited from Element.)
CreatedPhaseId
 Id of a Phase at which the Element was created.
 (Inherited from Element.)
DemolishedPhaseId
 Id of a Phase at which the Element was demolished.
 (Inherited from Element.)
DesignOption
Returns the design option to which the element belongs.
 (Inherited from Element.)
Document
Returns the Document in which the Element resides.
 (Inherited from Element.)
ExternalResourceType
 The type of external resources that represents images.
FamilyName
 Gets the family name of this element type.
 (Inherited from ElementType.)
Geometry
Retrieves the geometric representation of the element.
 (Inherited from Element.)
GroupId
 The id of the group to which an element belongs.
 (Inherited from Element.)
Height
 The vertical size of the image
HeightInPixels
 Number of pixels in the vertical direction of the image
Id
 A unique identifier for an Element in an Autodesk Revit project.
 (Inherited from Element.)
IsTransient
 Indicates whether an element is transient or permanent.
 (Inherited from Element.)
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from Element.)
IsViewImage |  Obsolete.
 The ImageType was created via "Save to Project as Image" function. For such ImageTypes the file path is an empty string.
LevelId
 The id of the level associated with the element.
 (Inherited from Element.)
Location
This property is used to find the physical location of an element within a project.
 (Inherited from Element.)
Name
Set the name for the ElementType.
 (Inherited from ElementType.)
OwnerViewId
 The id of the view that owns the element.
 (Inherited from Element.)
PageNumber
 The number of the page in a multi-page file, that was used to create the image in the ImageType.
Parameter[Guid]
Retrieves a parameter from the element given a GUID for a shared parameter.
 (Inherited from Element.)
Parameter[BuiltInParameter]
Retrieves a parameter from the element given a parameter id.
 (Inherited from Element.)
Parameter[Definition]
Retrieves a parameter from the element based on its definition.
 (Inherited from Element.)
Parameters
Retrieves a set containing all of the parameters that are contained within the element.
 (Inherited from Element.)
ParametersMap
Retrieves a map containing all of the parameters that are contained within the element.
 (Inherited from Element.)
Path
 The path to the file from which the ImageType was loaded.
PathType
 The path type that was used to refer to the file from which the ImageType was loaded.
Pinned
 Identifies if the element has been pinned to prevent changes.
 (Inherited from Element.)
Resolution
 The size of the pixels in the image, expressed in dots-per-inch (dpi)
Source
 The source of the image in the ImageType.
Status
 The status of the image
UniqueId
 A stable unique identifier for an element within the document.
 (Inherited from Element.)
VersionGuid
 Get the element version Guid.
 (Inherited from Element.)
ViewSpecific
 Identifies if the element is owned by a view.
 (Inherited from Element.)
Width
 The horizontal size of the image
WidthInPixels
 Number of pixels in the horizontal direction of the image
WorksetId
 Get Id of the Workset which owns the element.
 (Inherited from Element.)
See Also
ImageType Class
Autodesk.Revit.DB Namespace